; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared3 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation0 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon4)
	(have_image Phenomenon4 infrared3)
	(have_image Planet5 spectrograph0)
	(have_image Planet6 image1)
	(have_image Phenomenon7 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 5
5. (take_image satellite0 phenomenon4 instrument0 infrared3)
   added: (have_image phenomenon4 infrared3)
   goals met: 2 of 5
6. (turn_to satellite0 phenomenon7 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon4)
   goals met: 3 of 5
9. (turn_to satellite0 planet5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet5)
   goals met: 2 of 5
10. (take_image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 3 of 5
11. (turn_to satellite0 phenomenon4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon4)
   goals met: 4 of 5
12. (turn_to satellite0 planet6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
13. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 4 of 5
14. (turn_to satellite0 phenomenon4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon4)
   goals met: 5 of 5
